In [1]:
# import libraries

import pandas as pd


import numpy as np

import warnings
warnings.filterwarnings ('ignore')

pd.set_option('display.max_columns', None)
pd.set_option('display.max_rows', None)

import seaborn as sns

import matplotlib.pyplot as plt

LIMPIEZA CSV ACTORS

In [28]:
actors = pd.read_csv('../Data-Base-Project/data/actor.csv')

actors.head(5)

   actor_id first_name     last_name
0         1   PENELOPE       GUINESS
1         2       NICK      WAHLBERG
2         3         ED         CHASE
3         4   JENNIFER         DAVIS
4         5     JOHNNY  LOLLOBRIGIDA

In [3]:
actors.last_update.value_counts()

2006-02-15 04:34:33    200
Name: last_update, dtype: int64

In [4]:
#es una columna que tiene todos los valores repetidos por lo que la vamos a borrar

actors.drop(columns=['last_update'], inplace=True)

In [5]:
actors.shape

(200, 3)

In [6]:
nan_cols1 = actors.isna().sum()

nan_cols1[nan_cols1>0].sort_values(ascending=True) # no hay nulos

Series([], dtype: int64)

In [7]:
actors.to_csv('../Data-Base-Project/data/actor.csv', index = False) #sobreescribimos el archivo csv porque tenemos una copia del original en la terminal

LIMPIEZA CSV CATEGORY

In [27]:
category = pd.read_csv('../Data-Base-Project/data/category.csv')

category.head(5)

   category_id       name
0            1     Action
1            2  Animation
2            3   Children
3            4   Classics
4            5     Comedy

In [9]:
#es una columna que tiene todos los valores repetidos por lo que la vamos a borrar

category.drop(columns=['last_update'], inplace=True)

In [10]:
category.shape

(16, 2)

In [11]:
nan_cols2 = category.isna().sum()

nan_cols2[nan_cols2>0].sort_values(ascending=True) # no hay nulos

Series([], dtype: int64)

In [12]:
category.to_csv('../Data-Base-Project/data/category.csv', index = False) #sobreescribimos el archivo csv porque tenemos una copia del original en la terminal

LIMPIEZA CSV FILM

In [26]:
films = pd.read_csv('../Data-Base-Project/data/film.csv')

films.head(5)

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes"
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,3,4.99,48,12.99,G,"Trailers,Deleted Scenes"
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes"
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes"
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,6,2.99,130,22.99,G,Deleted Scenes

In [14]:
films.shape

(1000, 13)

In [15]:
#es una columna que tiene todos los valores repetidos por lo que la vamos a borrar

films.drop(columns=['last_update'], inplace=True)

In [16]:
nan_cols3 = films.isna().sum()

nan_cols3[nan_cols3>0].sort_values(ascending=True) # no hay nulos

original_language_id    1000
dtype: int64

In [17]:
#la columna  original_language_id tiene todo valores nulos, así que la vamos a eliminar

films.drop(columns=['original_language_id'], inplace=True)

In [18]:
films.shape

(1000, 11)

In [19]:
films.to_csv('../Data-Base-Project/data/film.csv', index = False) #sobreescribimos el archivo csv porque tenemos una copia del original en la terminal

LIMPIEZA CSV INVENTORY

In [25]:
inventory = pd.read_csv('../Data-Base-Project/data/inventory.csv')

inventory.head(5)

   inventory_id  film_id  store_id          last_update
0             1        1         1  2006-02-15 05:09:17
1             2        1         1  2006-02-15 05:09:17
2             3        1         1  2006-02-15 05:09:17
3             4        1         1  2006-02-15 05:09:17
4             5        1         2  2006-02-15 05:09:17

In [23]:
#es una columna que tiene todos los valores repetidos por lo que la vamos a borrar

inventory.drop(columns=['last_update'], inplace=True)

In [24]:
nan_cols4 = films.isna().sum()

nan_cols4[nan_cols4>0].sort_values(ascending=True) # no hay nulos

Series([], dtype: int64)